tap "brewsci/science"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "osgeo/osgeo4mac"
cask "xquartz"
brew "openssl@1.1"
brew "python@3.8"
brew "coreutils"
brew "curl"
brew "doxygen"
brew "exiftool"
brew "netcdf"
brew "numpy"
brew "poppler"
brew "gdal"
brew "gdb"
brew "git"
brew "hub"
brew "imagemagick"
brew "ncftp"
brew "ncview"
brew "p7zip"
brew "scipy"
brew "unrar"
brew "wget"
brew "z"
brew "brewsci/science/cdo"
cask "adoptopenjdk"
cask "alacritty"
cask "anaconda"
cask "basictex"
cask "blockstack"
cask "cyberduck"
cask "exodus"
cask "gfortran"
cask "inkscape"
cask "iterm2"
cask "monero-wallet"
cask "skyfonts"
cask "sourcetree"
cask "tor-browser"
