tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

# I feel like these are not controversial
brew "ack"
brew "curl"
brew 'bash-completion'
brew "bzip2"
brew "coreutils"
brew 'diff-so-fancy'
brew "exiftool"
brew "gdb"
brew "git"
brew "hub"
brew "libpng"
brew 'libtiff'
brew "netcdf"
brew "openssl"
brew "pip-completion"
brew "p7zip"
brew "pyenv"
brew "readline"
brew "tree"
brew "unrar"
brew "wget"
brew "zsh"

# casks are for gui's / applications / large binaries
cask "skyfonts"

# just in case, since this interfered with conda
# cask "gfortran"

# keeping these separate in case I want to use pyenv
# brew "python"
# brew "scipy"
# brew "gdal"

# Items I downloaded by hand but wish to track for future
# brew cask iterm2

# Items I am excluding for various reasons
# cask alacritty
# cask monero-wallet
# cask transmit
# cask anaconda
# cask blockstack
# cask exodus
# cask tor-browser
# cask sourcetree #bitbucket cloning gui
# cask "inkscape"
