tap "awvwgk/fpm"
tap "homebrew/bundle"
tap "homebrew/services"
tap "raggi/ale"
brew "ack"
brew "libpng"
brew "libtiff"
brew "bzip2"
brew "readline"
brew "gcc"
brew "open-mpi"
brew "bash"
brew "bash-completion", link: false
brew "bash-completion@2"
brew "bc"
brew "boost"
brew "glib"
brew "hdf5", link: false
brew "netcdf"
brew "cdo"
brew "cgal"
brew "cmake"
brew "cmake-docs"
brew "coreutils"
brew "curl"
brew "diff-so-fancy"
brew "doxygen"
brew "ghostscript"
brew "exiftool"
brew "expat"
brew "fypp"
brew "gawk"
brew "gcc@11"
brew "unbound"
brew "gnutls"
brew "gnupg"
brew "libgeotiff"
brew "libpq"
brew "numpy"
brew "poppler"
brew "gdal"
brew "gdb"
brew "gh"
brew "git"
brew "git-extras"
brew "glab"
brew "librsvg"
brew "graphviz"
brew "grip"
brew "hdf5-mpi"
brew "hub"
brew "libomp", link: true
brew "imagemagick"
brew "imageoptim-cli"
brew "lapack"
brew "llvm@17"
brew "macos-trash"
brew "mandoc"
brew "matlab2tikz"
brew "mercurial"
brew "metis"
brew "modules"
brew "texinfo"
brew "nco"
brew "ncview"
brew "octave"
brew "openconnect"
brew "p7zip"
brew "pandoc"
brew "parallel"
brew "pip-completion"
brew "pnetcdf"
brew "pwgen"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pyenv-virtualenvwrapper"
brew "python@3.10"
brew "r", link: false
brew "rclone"
brew "scotch"
brew "shellcheck"
brew "spatialindex"
brew "starship"
brew "subversion"
brew "tectonic"
brew "tldr"
brew "tnftp"
brew "tree"
brew "wget"
brew "yadm"
brew "zsh"
brew "awvwgk/fpm/fpm"
brew "raggi/ale/openssl-osx-ca"
cask "basictex"
cask "emacs"
cask "font-3270-nerd-font"
cask "font-agave-nerd-font"
cask "font-anonymice-nerd-font"
cask "font-arimo-nerd-font"
cask "font-aurulent-sans-mono-nerd-font"
cask "font-bigblue-terminal-nerd-font"
cask "font-bitstream-vera-sans-mono-nerd-font"
cask "font-blex-mono-nerd-font"
cask "font-caskaydia-cove-nerd-font"
cask "font-code-new-roman-nerd-font"
cask "font-cousine-nerd-font"
cask "font-daddy-time-mono-nerd-font"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-go-mono-nerd-font"
cask "font-gohufont-nerd-font"
cask "font-hack-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-heavy-data-nerd-font"
cask "font-hurmit-nerd-font"
cask "font-im-writing-nerd-font"
cask "font-inconsolata-go-nerd-font"
cask "font-inconsolata-lgc-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-lekton-nerd-font"
cask "font-liberation-nerd-font"
cask "font-m+-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-monofur-nerd-font"
cask "font-monoid-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-noto-nerd-font"
cask "font-open-dyslexic-nerd-font"
cask "font-overpass-nerd-font"
cask "font-profont-nerd-font"
cask "font-proggy-clean-tt-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-shure-tech-mono-nerd-font"
cask "font-space-mono-nerd-font"
cask "font-terminess-ttf-nerd-font"
cask "font-tinos-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "font-ubuntu-nerd-font"
cask "font-victor-mono-nerd-font"
cask "imageoptim"
cask "julia"
cask "paraview"
cask "r"
cask "rstudio"
cask "skyfonts"
cask "sublime-text"
cask "temurin"
cask "the-unarchiver"
cask "xquartz"
vscode "affenwiesel.matlab-formatter"
vscode "akamud.vscode-theme-onelight"
vscode "alefragnani.project-manager"
vscode "apommel.matlab-interactive-terminal"
vscode "azemoh.one-monokai"
vscode "bat67.matlab-extension-pack"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "bramvanbilsen.matlab-code-run"
vscode "bubersson.theme-hop-light"
vscode "chrischinchilla.vscode-pandoc"
vscode "chrisjsewell.myst-tml-syntax"
vscode "christian-kohler.path-intellisense"
vscode "cschlosser.doxdocgen"
vscode "davidanson.vscode-markdownlint"
vscode "dendron.dendron-markdown-shortcuts"
vscode "dnicolson.binary-plist"
vscode "donjayamanne.githistory"
vscode "dotiful.dotfiles-syntax-highlighting"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "efoerster.texlab"
vscode "entuent.fira-code-nerd-font"
vscode "epivision.vscode-file-header"
vscode "esbenp.prettier-vscode"
vscode "executablebookproject.myst-highlight"
vscode "formulahendry.code-runner"
vscode "formulahendry.docker-explorer"
vscode "fortran-lang.linter-gfortran"
vscode "george-alisson.html-preview-vscode"
vscode "gimly81.matlab"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gitkendra.hop-light-with-italics"
vscode "goessner.mdmath"
vscode "henriiik.docker-linter"
vscode "heron.firefox-devtools-theme"
vscode "huytd.nord-light"
vscode "ionutvmi.path-autocomplete"
vscode "jamespgilbert.comment-labels"
vscode "jeff-hykin.better-cpp-syntax"
vscode "jgclark.vscode-todo-highlight"
vscode "johnpapa.vscode-peacock"
vscode "johnstoncode.svn-scm"
vscode "jprestidge.theme-material-theme"
vscode "julialang.language-julia"
vscode "lakshits11.monokai-pirokai"
vscode "lextudio.restructuredtext"
vscode "lextudio.restructuredtext-pack"
vscode "linhmtran168.mac-ca-vscode"
vscode "loilo.snazzy-light"
vscode "marp-team.marp-vscode"
vscode "mathcale.theme-dracula-refined"
vscode "mathworks.language-matlab"
vscode "maxcutlyp.dotenv-autocomplete"
vscode "mikestead.dotenv"
vscode "mikhail-arkhipov.r"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.theme-tomorrowkit"
vscode "ms-vscode.wordcount"
vscode "njpwerner.autodocstring"
vscode "notzaki.pandocciter"
vscode "pkief.material-icon-theme"
vscode "rdebugger.r-debugger"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "reditorsupport.r"
vscode "robole.markdown-shortcuts"
vscode "robole.markdown-snippets"
vscode "robole.snippets-ranger"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shengdi.matlab-custom-package"
vscode "slaier.matlab-complete"
vscode "streetsidesoftware.code-spell-checker"
vscode "swyddfa.esbonio"
vscode "tamasfe.even-better-toml"
vscode "therepoclub.fileheadergenerator"
vscode "timonwong.shellcheck"
vscode "toasty-technologies.octave"
vscode "tomoki1207.pdf"
vscode "trond-snekvik.simple-rst"
vscode "twxs.cmake"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vomout.latex-syntax"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-org-mode.org-mode"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "zhikui.vscode-openfoam"
vscode "zhuangtongfa.material-theme"
